examples/phtMetalExtractionFoam/melting/SS+BAC+Cu/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*
energyRelease
{
    type            scalarSemiImplicitSource;

    selectionMode   all;
//	cellZone        heatSource;
	
	h 100;
	Tinf 300;
	R 5;

	volumeMode      specific;

    injectionRateSuSp
    {
        Tc           (#eval "2*$h*$Tinf/$R" #eval "-2*$h/$R");
    }
}
*/

// ************************************************************************* //
