examples/phtMetalExtractionFoam/melting/SS+BAC+Cu/constant/reactionProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

heterogeneousCombustion
{
    #include "/mnt/c/Users/Common/OpenFOAM/cases/porousHeatTransfer/phtMetalExtractionFoam/melting/Data/BAC_combustion"
}

evaporationCondensation
{
    #include "/mnt/c/Users/Common/OpenFOAM/cases/porousHeatTransfer/phtMetalExtractionFoam/melting/Data/Cu_evpcnd"
}

// ************************************************************************* //
