examples/phtMetalExtractionFoam/melting/SS+BAC+Cu/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue T.solid 300
    volScalarFieldValue T.fluid 300
);

regions
(

    boxToCell
    {
        box (-1 0 -1) (1 .1 1);

        fieldValues
        (
            volScalarFieldValue T.solid 900
	//		volScalarFieldValue T.fluid 599
        );
    }
);

// ************************************************************************* //
